Tekla.Structures.Drawing.View
The View class contains methods related to views.
Views are views that contain other drawing objects, excluding other views.
Views also contain drawing representations of model objects.
The following example creates and inserts a new view to the active drawing. A drawing must be open when executing the code.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
Drawing Drawing = MyDrawingHandler.GetActiveDrawing();
CoordinateSystem CoordinateSystem = new CoordinateSystem(new Point(), new Vector(1, 0, 0), new Vector(0, 1, 0));
View newView = new View(Drawing.GetSheet(), CoordinateSystem, CoordinateSystem, new AABB(new Point(0, 0), new Point(1000, 1000, 1000)));
newView.Insert();
}
}
}

Tekla.Structures.Drawing.View.CreateSectionView(Tekla.Structures.Drawing.View,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes,Tekla.Structures.Drawing.View@,Tekla.Structures.Drawing.SectionMark@)
Generates a new section view on the sheet and the associated section mark for the specified view.
view: The view in which to place the section mark.
startPoint: The starting point of the section mark.
endPoint: The ending point of the section mark.
viewInsertionPoint: The point where to create the section view.
depthUp: The view depth up that the section view should cover.
depthDown: The view depth down that the section view should cover.
viewAttributes: The attributes for the section view to be created.
sectionMarkAttributes: The attributes for the section mark to be created.
sectionView:
The created section view is returned if the creation was successful. Otherwise, null is returned.
sectionMark:
The created section mark is returned if the creation was successful. Otherwise, null is returned.
Returns: True if the section view was created successfully.

Tekla.Structures.Drawing.View.CreateCurvedSectionView(Tekla.Structures.Drawing.View,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes,Tekla.Structures.Drawing.View@,Tekla.Structures.Drawing.CurvedSectionMark@)
Generates a new curved section view on the sheet and the associated section mark for the specified view.
view: The view in which to place the section mark.
startPoint: The starting point of the section mark.
middlePoint: The middle point of the section mark.
endPoint: The ending point of the section mark.
viewInsertionPoint: The point where to create the section view.
depthUp: The view depth up that the section view should cover.
depthDown: The view depth down that the section view should cover.
viewAttributes: The attributes for the section view to be created.
sectionMarkAttributes: The attributes for the section mark to be created.
curvedSectionView:
The created section view is returned if the creation was successful. Otherwise, null is returned.
sectionMark:
The created section mark is returned if the creation was successful. Otherwise, null is returned.
Returns: True if the section view was created successfully.

Tekla.Structures.Drawing.View.CreateDetailView(Tekla.Structures.Drawing.View,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes,Tekla.Structures.Drawing.View@,Tekla.Structures.Drawing.DetailMark@)
Generates a new detail view on the sheet and the associated detail mark for the specified view.
view: The view in which to place the detail mark.
centerPoint: The center point of the detail mark.
boundaryPoint: The boundary point of the detail mark.
labelPoint: The label point of the detail mark label.
viewInsertionPoint: The point where to create the detail view.
viewAttributes: The attributes for the detail view to be created.
detailMarkAttributes: The attributes for the detail mark to be created.
detailView:
The created detail view is returned if the creation was successful. Otherwise, null is returned.
detailMark:
The created detail mark is returned if the creation was successful. Otherwise, null is returned.
Returns: True if the detail view was created successfully.

Tekla.Structures.Drawing.View.CreateFrontView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new front view on the sheet of the given drawing.
drawing: The drawing in which to create the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.CreateTopView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new top view on the sheet of the given drawing.
drawing: The drawing in which to create the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.CreateBackView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new back view on the sheet of the given drawing.
drawing: The drawing in which to create the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.CreateBottomView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new bottom view on the sheet of the given drawing.
drawing: The drawing in which to create the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.Create3dView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new 3d view on the sheet of the given drawing.
drawing: The drawing in which to create the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.Create3dView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.AABB,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new 3d view on the sheet of the given drawing using given view plane and display plane.
drawing: The drawing in which to create the view.
viewPlane: The view plane.
displayPlane: The display plane of the view.
viewExtrema: The restriction box of the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.